print('Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .')

letter1 = input('покрытая:')

letter2 = input('кожиц...й:')

letter3 = input('держится на ... : ')

letter4 = input('ножк... :')

letter5 = input('затянута ... :')

letter6 = input('нижняя ... :')

letter7 = input('шляпк... :')

print(f'Шляпка гриба, покрытая {letter1} кожиц{letter2}й, держится на {letter3} ножк{letter4} . Снизу шляпка затянута {letter5} плёнкой. Когда её уберешь, откроется нижняя {letter6} сторона шляпк{letter7} .')
