from Hero import *


print(f''' 
         =====================================================================
         |Герой                           |   Армия                          |
         =====================================================================
         |Здоровье вашего героя:{self.hp}|Армия вашего героя:{self.army}     |
         |Урон вашего героя:{self.dmg}   |Урон армии героя:{self.army_dmg}   |
         |                               |Здоровье армии героя:{self.army_hp}|
         ===================================================================== 
         |                 Общий урон:{self.dmg + self.army_dmg}             |
         =====================================================================

              ''')





print(f'Здоровье вашего героя:{self.hp}')
        print(f'Урон вашего героя:{self.dmg}')
        print(f'Армия вашего героя:{self.army}')
        print(f'Урон армии героя:{self.army_dmg}')
        print(f'Здоровье армии героя:{self.army_hp}')
        print(f'Общий урон:{self.dmg + self.army_dmg}')


  print(f'Здоровье вашего замка:{self.hp}')
        print(f'Ваша армия:{self.army}')
        print(f'Урон вашей армии:{self.dmg}')
        print(f'Здоровье вашей армии:{self.army_hp}')